In [1]:
import pandas as pd

In [7]:
surveys = pd.read_csv('StackOverflowDeveloperSurvey.csv', usecols=['CompanySize'])

In [8]:
surveys.head()

                CompanySize
0                       NaN
1        20 to 99 employees
2  10,000 or more employees
3  10,000 or more employees
4        10 to 19 employees

In [15]:
surveys[1:11]

                 CompanySize
1         20 to 99 employees
2   10,000 or more employees
3   10,000 or more employees
4         10 to 19 employees
5                        NaN
6         20 to 99 employees
7    Fewer than 10 employees
8   5,000 to 9,999 employees
9                        NaN
10      100 to 499 employees

In [16]:
surveys[12341:12351]

                    CompanySize
12341                       NaN
12342  1,000 to 4,999 employees
12343  10,000 or more employees
12344      100 to 499 employees
12345        20 to 99 employees
12346                       NaN
12347   Fewer than 10 employees
12348        20 to 99 employees
12349        20 to 99 employees
12350        20 to 99 employees

In [24]:
surveys.sort(by=['CompanySize'], inplace=True)

In [25]:
surveys.head()

                    CompanySize
21923  1,000 to 4,999 employees
48599  1,000 to 4,999 employees
48597  1,000 to 4,999 employees
8147   1,000 to 4,999 employees
1223   1,000 to 4,999 employees

In [26]:
surveys.reset_index(drop=True,inplace=True)